In [1]:
import pandas as pd
import numpy as np

In [2]:
portfolio = pd.read_json('./data/portfolio.json', orient='records', lines=True)

In [3]:
portfolio

,reward,channels,difficulty,duration,offer_type,id
0,10,"[email, mobile, social]",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,10,"[web, email, mobile, social]",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,0,"[web, email, mobile]",0,4,informational,3f207df678b143eea3cee63160fa8bed
3,5,"[web, email, mobile]",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
4,5,"[web, email]",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7
5,3,"[web, email, mobile, social]",7,7,discount,2298d6c36e964ae4a3e7e9706d1fb8c2
6,2,"[web, email, mobile, social]",10,10,discount,fafdcd668e3743c1bb461111dcafc2a4
7,0,"[email, mobile, social]",0,3,informational,5a8bc65990b245e5a138643cd4eb9837
8,5,"[web, email, mobile, social]",5,5,bogo,f19421c1d4aa40978ebb69ca19b0e20d
9,2,"[web, email, mobile]",10,7,discount,2906b810c7d4411798c6938adc9daaa5

In [5]:
portfolio.shape

(10, 6)

In [20]:
type(portfolio.channels)

pandas.core.series.Series

In [21]:
portfolio.channels.apply(pd.Series).stack()

0  0     email
   1    mobile
   2    social
1  0       web
   1     email
   2    mobile
   3    social
2  0       web
   1     email
   2    mobile
3  0       web
   1     email
   2    mobile
4  0       web
   1     email
5  0       web
   1     email
   2    mobile
   3    social
6  0       web
   1     email
   2    mobile
   3    social
7  0     email
   1    mobile
   2    social
8  0       web
   1     email
   2    mobile
   3    social
9  0       web
   1     email
   2    mobile
dtype: object

In [4]:
profile = pd.read_json('./data/profile.json', orient='records', lines=True)

In [5]:
transcript = pd.read_json('./data/transcript.json', orient='records', lines=True)

In [6]:
transcript.head()

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

In [8]:
df_person=transcript.groupby(['person']).count()

In [13]:
person=transcript.groupby(['person'])

In [10]:
df_person.head()

                                  event  value  time
person
0009655768c64bdeb2e877511632db8f     20     20    20
00116118485d4dfda04fdbaba9a87b5c      7      7     7
0011e0d4e6b944f998e987f904e8c1e5     18     18    18
0020c2b971eb4e9188eac86d93036a77     19     19    19
0020ccbbb6d84e358d3414a3ff76cffd     23     23    23

In [11]:
df_person.tail()

                                  event  value  time
person
fff3ba4757bd42088c044ca26d73817a     23     23    23
fff7576017104bcc8677a8d63322b5e1     18     18    18
fff8957ea8b240a6b5e634b6ee8eafcf     10     10    10
fffad4f4828548d1b5583907f2e9906b     23     23    23
ffff82501cea40309d5fdd7edcca4a07     33     33    33

In [14]:
person.get_group("fff3ba4757bd42088c044ca26d73817a")

,person,event,value,time
3787,fff3ba4757bd42088c044ca26d73817a,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
16325,fff3ba4757bd42088c044ca26d73817a,offer viewed,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},6
16326,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 20.98},6
16327,fff3ba4757bd42088c044ca26d73817a,offer completed,{'offer_id': 'fafdcd668e3743c1bb461111dcafc2a4...,6
22894,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 23.6},24
33031,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 21.92},60
41176,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 14.91},96
57047,fff3ba4757bd42088c044ca26d73817a,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},168
66953,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 22.76},168
66954,fff3ba4757bd42088c044ca26d73817a,offer completed,{'offer_id': '9b98b8c7a33c4b65b9aebfe6a799e6d9...,168
77896,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 18.23},192
83982,fff3ba4757bd42088c044ca26d73817a,offer viewed,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},210
87690,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 10.99},222
108243,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 15.45},318
114699,fff3ba4757bd42088c044ca26d73817a,offer received,{'offer id': '5a8bc65990b245e5a138643cd4eb9837'},336
154453,fff3ba4757bd42088c044ca26d73817a,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},408
205392,fff3ba4757bd42088c044ca26d73817a,offer received,{'offer id': '5a8bc65990b245e5a138643cd4eb9837'},504
228642,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 17.83},528
228643,fff3ba4757bd42088c044ca26d73817a,offer completed,{'offer_id': '2906b810c7d4411798c6938adc9daaa5...,528
233587,fff3ba4757bd42088c044ca26d73817a,offer viewed,{'offer id': '5a8bc65990b245e5a138643cd4eb9837'},540
233588,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 388.22},540
237974,fff3ba4757bd42088c044ca26d73817a,transaction,{'amount': 26.09},552
248948,fff3ba4757bd42088c044ca26d73817a,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},576

In [8]:
profile.shape

(17000, 5)

In [9]:
profile.isna().mean()

gender              0.127941
age                 0.000000
id                  0.000000
became_member_on    0.000000
income              0.127941
dtype: float64

In [10]:
profile.isna()

       gender    age     id  became_member_on  income
0        True  False  False             False    True
1       False  False  False             False   False
2        True  False  False             False    True
3       False  False  False             False   False
4        True  False  False             False    True
...       ...    ...    ...               ...     ...
16995   False  False  False             False   False
16996   False  False  False             False   False
16997   False  False  False             False   False
16998   False  False  False             False   False
16999   False  False  False             False   False

[17000 rows x 5 columns]

In [12]:
data={"a":[1,4,5],"b":[3,5,np.nan],"c":[1,2,np.nan]}

In [27]:
data1={"a":[np.nan,4,5],"b":[3,np.nan,9],"c":[1,2,np.nan]}

In [28]:
de=pd.DataFrame(data)

In [29]:
de1=pd.DataFrame(data1)

In [30]:
de

   a    b    c
0  1  3.0  1.0
1  4  5.0  2.0
2  5  NaN  NaN

In [31]:
de.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False   True   True

In [32]:
de.isnull().sum()

a    0
b    1
c    1
dtype: int64

In [33]:
de.isnull().mean() #ใช้ mean เพื่อดูการกระจายตัวของ nan

a    0.000000
b    0.333333
c    0.333333
dtype: float64

In [34]:
de1

     a    b    c
0  NaN  3.0  1.0
1  4.0  NaN  2.0
2  5.0  9.0  NaN

In [35]:
de1.isnull().mean()

a    0.333333
b    0.333333
c    0.333333
dtype: float64

In [43]:
profile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   gender            14825 non-null  object
 1   age               17000 non-null  int64
 2   id                17000 non-null  object
 3   became_member_on  17000 non-null  int64
 4   income            14825 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 664.2+ KB

In [44]:
profile.isnull().sum()

gender              2175
age                    0
id                     0
became_member_on       0
income              2175
dtype: int64

In [45]:
profile.head(20)

   gender  age                                id  became_member_on    income
0    None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1       F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2    None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3       F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4    None  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN
5       M   68  e2127556f4f64592b11af22de27a7932          20180426   70000.0
6    None  118  8ec6ce2a7e7949b1bf142def7d0e0586          20170925       NaN
7    None  118  68617ca6246f4fbc85e91a2a49552598          20171002       NaN
8       M   65  389bc3fa690240e798340f5a15918d5c          20180209   53000.0
9    None  118  8974fc5686fe429db53ddde067b88302          20161122       NaN
10   None  118  c4863c7985cf408faee930f111475da3          20170824       NaN
11   None  118  148adfcaa27d485b82f323aaaad036bd          20150919       NaN
12      M   58  2eeac8d8feae4a8cad5a6af0499a211d          20171111   51000.0
13      F   61  aa4862eba776480b8bb9c68455b8c2e1          20170911   57000.0
14      M   26  e12aeaf2d47d42479ea1c4ac3d8286c6          20140213   46000.0
15      F   62  31dda685af34476cad5bc968bdb01c53          20160211   71000.0
16      M   49  62cf5e10845442329191fc246e7bcea3          20141113   52000.0
17   None  118  744d603ef08c4f33af5a61c8c7628d1c          20170801       NaN
18      M   57  6445de3b47274c759400cd68131d91b4          20171231   42000.0
19      F   61  a448667f336b42c9a66fc5ffd5d73772          20180501   40000.0

In [39]:
profile[profile['age']==118]

      gender  age                                id  became_member_on  income
0       None  118  68be06ca386d4c31939f3a4f0e3dd783          20170212     NaN
2       None  118  38fe809add3b4fcf9315a9694bb96ff5          20180712     NaN
4       None  118  a03223e636434f42ac4c3df47e8bac43          20170804     NaN
6       None  118  8ec6ce2a7e7949b1bf142def7d0e0586          20170925     NaN
7       None  118  68617ca6246f4fbc85e91a2a49552598          20171002     NaN
...      ...  ...                               ...               ...     ...
16980   None  118  5c686d09ca4d475a8f750f2ba07e0440          20160901     NaN
16982   None  118  d9ca82f550ac4ee58b6299cf1e5c824a          20160415     NaN
16989   None  118  ca45ee1883624304bac1e4c8a114f045          20180305     NaN
16991   None  118  a9a20fa8b5504360beb4e7c8712f8306          20160116     NaN
16994   None  118  c02b10e8752c4d8e9b73f918558531f7          20151211     NaN

[2175 rows x 5 columns]

In [62]:
profile.iloc[0:2,[2,4]]

                                 id    income
0  68be06ca386d4c31939f3a4f0e3dd783       NaN
1  0610b486422d4921ae7d2bf64640c50b  112000.0

In [49]:
print(profile.iloc[0,]['gender'])

None

In [50]:
print(profile.iloc[0,]['income'])

nan

In [ ]:
assert(profile.iloc[0,])

In [64]:
pd.get_dummies(portfolio.channels.apply(pd.Series).stack()).sum(level=1)

   email  mobile  social  web
0      2       0       0    8
1      8       2       0    0
2      0       7       2    0
3      0       0       4    0

In [38]:
profile[profile['gender'].isna()].index

Int64Index([    0,     2,     4,     6,     7,     9,    10,    11,    17,
               23,
            ...
            16942, 16951, 16953, 16969, 16977, 16980, 16982, 16989, 16991,
            16994],
           dtype='int64', length=2175)

In [41]:
profile['gender'].unique()

array([None, 'F', 'M', 'O'], dtype=object)

In [6]:
transcript

,person,event,value,time
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0
...,...,...,...,...
306529,b3a1272bc9904337b331bf348c3e8c17,transaction,{'amount': 1.5899999999999999},714
306530,68213b08d99a4ae1b0dcb72aebd9aa35,transaction,{'amount': 9.53},714
306531,a00058cf10334a308c68e7631c529907,transaction,{'amount': 3.61},714
306532,76ddbd6576844afe811f1a3c0fbb5bec,transaction,{'amount': 3.5300000000000002},714
306533,c02b10e8752c4d8e9b73f918558531f7,transaction,{'amount': 4.05},714

In [15]:
transcript['time'].describe()

count    306534.000000
mean        366.382940
std         200.326314
min           0.000000
25%         186.000000
50%         408.000000
75%         528.000000
max         714.000000
Name: time, dtype: float64

In [7]:
value_df = transcript['value'].apply(pd.Series)

In [8]:
value_df.head()

                           offer id  amount offer_id  reward
0  9b98b8c7a33c4b65b9aebfe6a799e6d9     NaN      NaN     NaN
1  0b1e1539f2cc45b7b9fa7c272da2e1d7     NaN      NaN     NaN
2  2906b810c7d4411798c6938adc9daaa5     NaN      NaN     NaN
3  fafdcd668e3743c1bb461111dcafc2a4     NaN      NaN     NaN
4  4d5c57ea9a6940dd891ad53e9dbe8da0     NaN      NaN     NaN

In [13]:
value_df.iloc[306529,]

offer id     NaN
amount      1.59
offer_id     NaN
reward       NaN
Name: 306529, dtype: object

In [2]:
s = pd.Series(list('pqrp'))

In [3]:
s

0    p
1    q
2    r
3    p
dtype: object

In [7]:
s1 = ['p', 'q', 'x','q','w']
pd.get_dummies(s1)

   p  q  w  x
0  1  0  0  0
1  0  1  0  0
2  0  0  0  1
3  0  1  0  0
4  0  0  1  0

In [11]:
gx=portfolio['offer_type']

In [12]:
type(gx)

pandas.core.series.Series

In [14]:
boto=pd.get_dummies(gx)

In [18]:
boto

   bogo  discount  informational
0     1         0              0
1     1         0              0
2     0         0              1
3     1         0              0
4     0         1              0
5     0         1              0
6     0         1              0
7     0         0              1
8     1         0              0
9     0         1              0

In [17]:
pd.concat([portfolio,boto] ,axis=1)

,reward,channels,difficulty,duration,offer_type,id,bogo,discount,informational
0,10,"[email, mobile, social]",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd,1,0,0
1,10,"[web, email, mobile, social]",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0,1,0,0
2,0,"[web, email, mobile]",0,4,informational,3f207df678b143eea3cee63160fa8bed,0,0,1
3,5,"[web, email, mobile]",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,0,0
4,5,"[web, email]",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7,0,1,0
5,3,"[web, email, mobile, social]",7,7,discount,2298d6c36e964ae4a3e7e9706d1fb8c2,0,1,0
6,2,"[web, email, mobile, social]",10,10,discount,fafdcd668e3743c1bb461111dcafc2a4,0,1,0
7,0,"[email, mobile, social]",0,3,informational,5a8bc65990b245e5a138643cd4eb9837,0,0,1
8,5,"[web, email, mobile, social]",5,5,bogo,f19421c1d4aa40978ebb69ca19b0e20d,1,0,0
9,2,"[web, email, mobile]",10,7,discount,2906b810c7d4411798c6938adc9daaa5,0,1,0